In [2]:
# Pandas中的排序和排名
# 排序
# 根据条件对数据集排序（sorting）也是一种重要的内置运算。要对行或列索引进行排序（按字典顺序），可使用sort_index方法，它将返回一个已排序的新对象：

obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [24]:
obj.sort_index()

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [6]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                  index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [8]:
frame.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [10]:
#若要按值对Series进行排序，可使用其sort_values方法：
obj=pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [12]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
t1=obj.sort_values()

In [15]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [16]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [17]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [21]:
t=frame.sort_values(by=['a', 'b'])
t.reset_index(drop=True)

   b  a
0 -3  0
1  4  0
2  2  1
3  7  1

In [23]:
# 排名
# 排名会从1开始一直到数组中有效数据的数量。接下来介绍Series和DataFrame的rank方法。默认情况下，rank是通过“为各组分配一个平均排名”的方式破坏平级关系的：

obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [28]:
tt=obj.rank(ascending=False,method='dense')

In [29]:
tt.sort_values()

0    1.0
2    1.0
3    2.0
6    2.0
4    3.0
5    4.0
1    5.0
dtype: float64

In [30]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [31]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [32]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [33]:
data = pd.DataFrame(data=[['bar','one','z','1'],
                          ['bar','two','v','2'],
                          ['foo','one','x','3'],
                          ['foo','two','w','4']])
data

     0    1  2  3
0  bar  one  z  1
1  bar  two  v  2
2  foo  one  x  3
3  foo  two  w  4

In [34]:
data.columns=['a','b','c','d']

In [35]:
data

     a    b  c  d
0  bar  one  z  1
1  bar  two  v  2
2  foo  one  x  3
3  foo  two  w  4

In [36]:
data.set_index('c')

     a    b  d
c
z  bar  one  1
v  bar  two  2
x  foo  one  3
w  foo  two  4

In [39]:
data.reset_index(drop=True)

     a    b  c  d
0  bar  one  z  1
1  bar  two  v  2
2  foo  one  x  3
3  foo  two  w  4

In [40]:
##将‘c’列设置为索引，并以追加的方式添加为二级索引
data.set_index('c',append=True)

       a    b  d
  c
0 z  bar  one  1
1 v  bar  two  2
2 x  foo  one  3
3 w  foo  two  4

In [44]:
data.reset_index(drop=True)

     a    b  c  d
0  bar  one  z  1
1  bar  two  v  2
2  foo  one  x  3
3  foo  two  w  4

In [45]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({
    "name":["小明","小红","小孙","王小","关宇","刘蓓","张菲"],
    "age":[20,18,27,20,28,18,25],
    "sex":["男","女","男","男","男","女","女"],
    "score":[669,570,642,590,601,619,701],
    "address":["北京","深圳","广州","武汉","深圳","广州","长沙"]
})

df1

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [46]:
df1.to_excel('D:/test1/学生信息.xlsx',index=False)

In [47]:
df1.shape

(7, 5)

In [48]:
df1.columns

Index(['name', 'age', 'sex', 'score', 'address'], dtype='object')

In [49]:
df1.dtypes

name       object
age         int64
sex        object
score       int64
address    object
dtype: object

In [50]:
df1.isnull()

    name    age    sex  score  address
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False
3  False  False  False  False    False
4  False  False  False  False    False
5  False  False  False  False    False
6  False  False  False  False    False

In [51]:
df1.isnull().sum()

name       0
age        0
sex        0
score      0
address    0
dtype: int64

In [53]:
df1.describe()

             age       score
count   7.000000    7.000000
mean   22.285714  627.428571
std     4.270608   46.227182
min    18.000000  570.000000
25%    19.000000  595.500000
50%    20.000000  619.000000
75%    26.000000  655.500000
max    28.000000  701.000000

In [59]:
name=df1[['name']]
name

  name
0   小明
1   小红
2   小孙
3   王小
4   关宇
5   刘蓓
6   张菲

In [56]:
name_age=df1[['name','age']]
name_age

  name  age
0   小明   20
1   小红   18
2   小孙   27
3   王小   20
4   关宇   28
5   刘蓓   18
6   张菲   25

In [60]:
df1.select_dtypes(include='int64')

   age  score
0   20    669
1   18    570
2   27    642
3   20    590
4   28    601
5   18    619
6   25    701

In [61]:
df1.select_dtypes(include=['int64','object'])

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [62]:
df1.select_dtypes(exclude='int64')

  name sex address
0   小明   男      北京
1   小红   女      深圳
2   小孙   男      广州
3   王小   男      武汉
4   关宇   男      深圳
5   刘蓓   女      广州
6   张菲   女      长沙

In [63]:
df1[(df1['age']>=20)&(df1['age']<27)]

  name  age sex  score address
0   小明   20   男    669      北京
3   王小   20   男    590      武汉
6   张菲   25   女    701      长沙

In [64]:
df1[df1['name']=='小明']

  name  age sex  score address
0   小明   20   男    669      北京

In [65]:
df1[(df1['name']=='小明')|(df1['age']>25)]

  name  age sex  score address
0   小明   20   男    669      北京
2   小孙   27   男    642      广州
4   关宇   28   男    601      深圳

In [66]:
df1[df1['name'].str.startswith('小')]

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州

In [67]:
df1[df1['name'].str.startswith('关')]

  name  age sex  score address
4   关宇   28   男    601      深圳

In [68]:
df1[df1['name'].str.endswith('菲')]

  name  age sex  score address
6   张菲   25   女    701      长沙

In [69]:
df1[df1['name'].str.contains('小')]

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉

In [70]:
df1[~df1['name'].str.contains('小')]

  name  age sex  score address
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [71]:
df1['class']=['one','two','one','two','two','one','one']

In [72]:
df1

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小红   18   女    570      深圳   two
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two
5   刘蓓   18   女    619      广州   one
6   张菲   25   女    701      长沙   one

In [74]:
address=df1['address'].value_counts()
address

深圳    2
广州    2
北京    1
武汉    1
长沙    1
Name: address, dtype: int64

In [75]:
address_new=address.reset_index()

In [76]:
address_new

  index  address
0    深圳        2
1    广州        2
2    北京        1
3    武汉        1
4    长沙        1

In [77]:
fale=df1[df1['sex']=='男']
fale

  name  age sex  score address class
0   小明   20   男    669      北京   one
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two

In [78]:
fale_1=fale.reset_index()
fale_1

   index name  age sex  score address class
0      0   小明   20   男    669      北京   one
1      2   小孙   27   男    642      广州   one
2      3   王小   20   男    590      武汉   two
3      4   关宇   28   男    601      深圳   two

In [79]:
fale_1=fale.reset_index(drop=True)
fale_1

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小孙   27   男    642      广州   one
2   王小   20   男    590      武汉   two
3   关宇   28   男    601      深圳   two

In [80]:
sex_score=df1.groupby('sex')['score'].sum()

In [81]:
sex_score

sex
女    1890
男    2502
Name: score, dtype: int64

In [82]:
sex_score=df1.groupby('sex')['score'].mean()

In [83]:
sex_score

sex
女    630.0
男    625.5
Name: score, dtype: float64

In [84]:
sex_class=df1.groupby(['sex','class'])['score'].sum()

In [85]:
sex_class

sex  class
女    one      1320
     two       570
男    one      1311
     two      1191
Name: score, dtype: int64

In [86]:
sex_class=sex_class.reset_index()

In [87]:
sex_class

  sex class  score
0   女   one   1320
1   女   two    570
2   男   one   1311
3   男   two   1191

In [89]:
#一行代码实现上面的功能：

# 一行代码实现

df1.groupby(["sex","class"])["score"].sum().reset_index()

  sex class  score
0   女   one   1320
1   女   two    570
2   男   one   1311
3   男   two   1191

In [90]:
df1

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小红   18   女    570      深圳   two
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two
5   刘蓓   18   女    619      广州   one
6   张菲   25   女    701      长沙   one

In [91]:
df2=df1.copy()

In [93]:
df2['sex']=df2['sex'].apply(lambda x:1 if x=='男' else 0)
df2

  name  age  sex  score address class
0   小明   20    1    669      北京   one
1   小红   18    0    570      深圳   two
2   小孙   27    1    642      广州   one
3   王小   20    1    590      武汉   two
4   关宇   28    1    601      深圳   two
5   刘蓓   18    0    619      广州   one
6   张菲   25    0    701      长沙   one

In [94]:
df3=df1.copy()
df3

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小红   18   女    570      深圳   two
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two
5   刘蓓   18   女    619      广州   one
6   张菲   25   女    701      长沙   one

In [97]:
df3['address']=df3['address'].apply(lambda x:x + '')
df3

  name  age sex  score address class
0   小明   20   男    669    北京市市   one
1   小红   18   女    570    深圳市市   two
2   小孙   27   男    642    广州市市   one
3   王小   20   男    590    武汉市市   two
4   关宇   28   男    601    深圳市市   two
5   刘蓓   18   女    619    广州市市   one
6   张菲   25   女    701    长沙市市   one

In [98]:
df3['address']=df3['address'].str.replace('市','')
df3

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小红   18   女    570      深圳   two
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two
5   刘蓓   18   女    619      广州   one
6   张菲   25   女    701      长沙   one

In [100]:
df3['address']=df3['address'].apply(lambda x:x + '市')
df3

  name  age sex  score address class
0   小明   20   男    669     北京市   one
1   小红   18   女    570     深圳市   two
2   小孙   27   男    642     广州市   one
3   王小   20   男    590     武汉市   two
4   关宇   28   男    601     深圳市   two
5   刘蓓   18   女    619     广州市   one
6   张菲   25   女    701     长沙市   one